---
kind: other
id: Methods.T:Autodesk.Revit.UI.RibbonItem
source: html/0a0b2d1e-3723-abff-71b8-69de785a3af8.htm
---
# RibbonItem Methods

Determines whether the specified Object is equal to the current Object .